/* No comment provided by engineer. */
"AboutAppText" = "The Harvard iPhone/iPod Touch application is part of a broader initiative to improve the mobile experience of students, faculty, staff, visitors, and neighbors who interact with Harvard's campus and community. We will continue to develop, expand and improve this application. We welcome your ideas and feedback.";

/* No comment provided by engineer. */
"AboutOrgText" = "Harvard University is devoted to excellence in teaching, learning, and research, and to developing leaders in many disciplines who make a difference globally. The University has twelve degree-granting Schools in addition to the Radcliffe Institute for Advanced Study.

Established in 1636, Harvard is the oldest institution of higher education in the United States. The University, which is based in Cambridge and Boston, Massachusetts, has an enrollment of over 20,000 degree candidates, including undergraduate, graduate, and professional students. Harvard has more than 360,000 alumni around the world.";

/* No comment provided by engineer. */
"AboutOrgTitle" = "AboutOrgTitle";

/* No comment provided by engineer. */
"Add to Existing Contact" = "Add to Existing Contact";

/* No comment provided by engineer. */
"Bad response from server. Please try again later." = "Bad response from server. Please try again later.";

/* No comment provided by engineer. */
"Bus Stop" = "Bus Stop";

/* No comment provided by engineer. */
"Connection Failed" = "Connection Failed";

/* No comment provided by engineer. */
"Could not connect to server. Please try again later." = "Could not connect to server. Please try again later.";

/* No comment provided by engineer. */
"Create New Contact" = "Create New Contact";

/* No comment provided by engineer. */
"Error Connecting" = "Error Connecting";

/* No comment provided by engineer. */
"Failed to register your device for a push notification. Please try again later." = "Failed to register your device for a push notification. Please try again later.";

/* No comment provided by engineer. */
"Failure connecting to Twitter" = "Failure connecting to Twitter";

/* No comment provided by engineer. */
"Last Updated" = "Last Updated";

/* No comment provided by engineer. */
"Login failed" = "Login failed";

/* No comment provided by engineer. */
"Network failed" = "Network failed";

/* No comment provided by engineer. */
"No Results Found" = "No Results Found";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Please check your Internet connection and try again later." = "Please check your Internet connection and try again later.";

/* No comment provided by engineer. */
"Problem connecting to server. Please try again later." = "Problem connecting to server. Please try again later.";

/* No comment provided by engineer. */
"Route" = "Route";

/* No comment provided by engineer. */
"Search" = "Search";

/* No comment provided by engineer. */
"Search Campus Map" = "Search Campus Map";

/* No comment provided by engineer. */
"Search Failed" = "Search Failed";

/* No comment provided by engineer. */
"Send Feedback" = "Send Feedback";

/* No comment provided by engineer. */
"Server is taking too long to respond. Please try again later." = "Server is taking too long to respond. Please try again later.";

/* No comment provided by engineer. */
"Subscription failed" = "Subscription failed";

/* No comment provided by engineer. */
"There was a problem retrieving data. Please check your connection and try again." = "There was a problem retrieving data. Please check your connection and try again.";

/* No comment provided by engineer. */
"Tip: You can search above by a person's first or last name or email address." = "Tip: You can search above by a person's first or last name or email address.";

/* No comment provided by engineer. */
"Twitter username and password is not recognized" = "Twitter username and password is not recognized";

/* No comment provided by engineer. */
"Your query returned no matches." = "Your query returned no matches.";

